## Data Types and Casting

Let's talk about data types. Some databases support only certain data types (for example, SQLite doesn't support datetime or timestamps). The database we are currently using, Postgres, supports many types from timestamps to varchar arrays. 

This exercise will get you up to speed on understanding data types and learning how to cast from one type to another.

In [1]:
# Load the SQL magic extension
%load_ext sql
# Connect to the default database (using SQLAlchemy)
%sql postgresql://localhost/postgres
# Truncate output of your queries so that it's not blowing up the notebook
%config SqlMagic.displaylimit = 10

### Overview of Data Types

There are several different types of data. Just a few important data types to name: numbers, text, and collections. In database terms, these are referred to integers / doubles for numbers, strings for text, and arrays for collections. Most of the time, when you look at a data set, you can probably guess what data type it is.

Take a quick look at the `actor` table.

In [28]:
%%sql
-- What are the data types for actor_id and first_name?
select * from actor limit 5

 * postgresql://localhost/postgres
5 rows affected.

[(1, 'Penelope', 'Guiness', datetime.datetime(2006, 2, 15, 10, 5)),
 (2, 'Nick', 'Wahlberg', datetime.datetime(2006, 2, 15, 10, 5)),
 (3, 'Ed', 'Chase', datetime.datetime(2006, 2, 15, 10, 5)),
 (4, 'Jennifer', 'Davis', datetime.datetime(2006, 2, 15, 10, 5)),
 (5, 'Johnny', 'Lollobrigida', datetime.datetime(2006, 2, 15, 10, 5))]

To double check, we can use the following query to confirm our suspicions. For some systems, there is a user interface layered on top of the data bricks (i.e. Toad and Oracle) that will allow for easier navigation to this information.

In [29]:
%%sql
select 
  column_name, 
  data_type 
from 
  information_schema.columns
where 
  table_name = 'film';

 * postgresql://localhost/postgres
13 rows affected.

[('film_id', 'integer'),
 ('title', 'character varying'),
 ('description', 'character varying'),
 ('release_year', 'integer'),
 ('language_id', 'integer'),
 ('rental_duration', 'integer'),
 ('rental_rate', 'double precision'),
 ('length', 'integer'),
 ('replacement_cost', 'double precision'),
 ('rating', 'character varying'),
 ('last_update', 'timestamp without time zone'),
 ('special_features', 'ARRAY'),
 ('full_text', 'character varying')]

Data types are important for when we have to compare between two different variables (i.e. checking equality or something else). In some systems, you can compare integers to strings because the backend will automatically convert the numbers to a string. However, in some systems, we have to cast them to the appropriate data type before we can perform conditional logic on them.

In [20]:
%%sql
-- Try checking if last_update is greater than last_name
-- What kind of error do you get?
select * from actor where last_update > last_name

 * postgresql://localhost/postgres
(psycopg2.errors.UndefinedFunction) operator does not exist: timestamp without time zone > character varying
LINE 3: select * from actor where last_update > last_name
                                              ^
HINT:  No operator matches the given name and argument type(s). You might need to add explicit type casts.
 [SQL: '-- Try checking if last_update is greater than last_name\n-- What kind of error do you get?\nselect * from actor where last_update > last_name'] (Background on this error at: http://sqlalche.me/e/f405)

In [16]:
%%sql
-- To cast a variable to another type, you need to use the cast() function
-- But note that comparing last_update to first_name might not make sense! 
select * from actor where cast(last_update as varchar) < last_name

 * postgresql://localhost/postgres
200 rows affected.

[(1, 'Penelope', 'Guiness', datetime.datetime(2006, 2, 15, 10, 5)),
 (2, 'Nick', 'Wahlberg', datetime.datetime(2006, 2, 15, 10, 5)),
 (3, 'Ed', 'Chase', datetime.datetime(2006, 2, 15, 10, 5)),
 (4, 'Jennifer', 'Davis', datetime.datetime(2006, 2, 15, 10, 5)),
 (5, 'Johnny', 'Lollobrigida', datetime.datetime(2006, 2, 15, 10, 5)),
 (6, 'Bette', 'Nicholson', datetime.datetime(2006, 2, 15, 10, 5)),
 (7, 'Grace', 'Mostel', datetime.datetime(2006, 2, 15, 10, 5)),
 (8, 'Matthew', 'Johansson', datetime.datetime(2006, 2, 15, 10, 5)),
 (9, 'Joe', 'Swank', datetime.datetime(2006, 2, 15, 10, 5)),
 (10, 'Christian', 'Gable', datetime.datetime(2006, 2, 15, 10, 5)),
 (11, 'Zero', 'Cage', datetime.datetime(2006, 2, 15, 10, 5)),
 (12, 'Karl', 'Berry', datetime.datetime(2006, 2, 15, 10, 5)),
 (13, 'Uma', 'Wood', datetime.datetime(2006, 2, 15, 10, 5)),
 (14, 'Vivien', 'Bergen', datetime.datetime(2006, 2, 15, 10, 5)),
 (15, 'Cuba', 'Olivier', datetime.datetime(2006, 2, 15, 10, 5)),
 (16, 'Fred', 'Costner', datetime.datetime(2006, 2, 15, 10, 5)),
 (17, 'Helen', 'Voight', datetime.datetime(2006, 2, 15, 10, 5)),
 (18, 'Dan', 'Torn', datetime.datetime(2006, 2, 15, 10, 5)),
 (19, 'Bob', 'Fawcett', datetime.datetime(2006, 2, 15, 10, 5)),
 (20, 'Lucille', 'Tracy', datetime.datetime(2006, 2, 15, 10, 5)),
 (21, 'Kirsten', 'Paltrow', datetime.datetime(2006, 2, 15, 10, 5)),
 (22, 'Elvis', 'Marx', datetime.datetime(2006, 2, 15, 10, 5)),
 (23, 'Sandra', 'Kilmer', datetime.datetime(2006, 2, 15, 10, 5)),
 (24, 'Cameron', 'Streep', datetime.datetime(2006, 2, 15, 10, 5)),
 (25, 'Kevin', 'Bloom', datetime.datetime(2006, 2, 15, 10, 5)),
 (26, 'Rip', 'Crawford', datetime.datetime(2006, 2, 15, 10, 5)),
 (27, 'Julia', 'Mcqueen', datetime.datetime(2006, 2, 15, 10, 5)),
 (28, 'Woody', 'Hoffman', datetime.datetime(2006, 2, 15, 10, 5)),
 (29, 'Alec', 'Wayne', datetime.datetime(2006, 2, 15, 10, 5)),
 (30, 'Sandra', 'Peck', datetime.datetime(2006, 2, 15, 10, 5)),
 (31, 'Sissy', 'Sobieski', datetime.datetime(2006, 2, 15, 10, 5)),
 (32, 'Tim', 'Hackman', datetime.datetime(2006, 2, 15, 10, 5)),
 (33, 'Milla', 'Peck', datetime.datetime(2006, 2, 15, 10, 5)),
 (34, 'Audrey', 'Olivier', datetime.datetime(2006, 2, 15, 10, 5)),
 (35, 'Judy', 'Dean', datetime.datetime(2006, 2, 15, 10, 5)),
 (36, 'Burt', 'Dukakis', datetime.datetime(2006, 2, 15, 10, 5)),
 (37, 'Val', 'Bolger', datetime.datetime(2006, 2, 15, 10, 5)),
 (38, 'Tom', 'Mckellen', datetime.datetime(2006, 2, 15, 10, 5)),
 (39, 'Goldie', 'Brody', datetime.datetime(2006, 2, 15, 10, 5)),
 (40, 'Johnny', 'Cage', datetime.datetime(2006, 2, 15, 10, 5)),
 (41, 'Jodie', 'Degeneres', datetime.datetime(2006, 2, 15, 10, 5)),
 (42, 'Tom', 'Miranda', datetime.datetime(2006, 2, 15, 10, 5)),
 (43, 'Kirk', 'Jovovich', datetime.datetime(2006, 2, 15, 10, 5)),
 (44, 'Nick', 'Stallone', datetime.datetime(2006, 2, 15, 10, 5)),
 (45, 'Reese', 'Kilmer', datetime.datetime(2006, 2, 15, 10, 5)),
 (46, 'Parker', 'Goldberg', datetime.datetime(2006, 2, 15, 10, 5)),
 (47, 'Julia', 'Barrymore', datetime.datetime(2006, 2, 15, 10, 5)),
 (48, 'Frances', 'Day-Lewis', datetime.datetime(2006, 2, 15, 10, 5)),
 (49, 'Anne', 'Cronyn', datetime.datetime(2006, 2, 15, 10, 5)),
 (50, 'Natalie', 'Hopkins', datetime.datetime(2006, 2, 15, 10, 5)),
 (51, 'Gary', 'Phoenix', datetime.datetime(2006, 2, 15, 10, 5)),
 (52, 'Carmen', 'Hunt', datetime.datetime(2006, 2, 15, 10, 5)),
 (53, 'Mena', 'Temple', datetime.datetime(2006, 2, 15, 10, 5)),
 (54, 'Penelope', 'Pinkett', datetime.datetime(2006, 2, 15, 10, 5)),
 (55, 'Fay', 'Kilmer', datetime.datetime(2006, 2, 15, 10, 5)),
 (56, 'Dan', 'Harris', datetime.datetime(2006, 2, 15, 10, 5)),
 (57, 'Jude', 'Cruise', datetime.datetime(2006, 2, 15, 10, 5)),
 (58, 'Christian', 'Akroyd', datetime.datetime(2006, 2, 15, 10, 5)),
 (59, 'Dustin', 'Tautou', datetime.datetime(2006, 2, 15, 10, 5)),
 (60, 'Henry', 'Berry', datetime.datetime(2006, 2, 15, 10, 5)),
 (61, 'Christian', 'Neeson', datetime.datetime(2006, 2, 15, 10, 5)),
 (62, 'Jayne', 'Neeson', datetime.datetime(2006, 2, 15, 10, 5)),
 (63, 'Cameron', 'Wray', datetime.datetime(2006, 2, 15, 10, 5)),
 (64, 'Ray', 'Johansson', datetime.datetime(2006, 2, 15, 10, 5)),
 (65, 'Angela', 'Hudson', datetime.datetime(2006, 2, 15, 10, 5)),
 (66, 'Mary', 'Tandy', datetime.datetime(2006, 2, 15, 10, 5)),
 (67, 'Jessica', 'Bailey', datetime.datetime(2006, 2, 15, 10, 5)),
 (68, 'Rip', 'Winslet', datetime.datetime(2006, 2, 15, 10, 5)),
 (69, 'Kenneth', 'Paltrow', datetime.datetime(2006, 2, 15, 10, 5)),
 (70, 'Michelle', 'Mcconaughey', datetime.datetime(2006, 2, 15, 10, 5)),
 (71, 'Adam', 'Grant', datetime.datetime(2006, 2, 15, 10, 5)),
 (72, 'Sean', 'Williams', datetime.datetime(2006, 2, 15, 10, 5)),
 (73, 'Gary', 'Penn', datetime.datetime(2006, 2, 15, 10, 5)),
 (74, 'Milla', 'Keitel', datetime.datetime(2006, 2, 15, 10, 5)),
 (75, 'Burt', 'Posey', datetime.datetime(2006, 2, 15, 10, 5)),
 (76, 'Angelina', 'Astaire', datetime.datetime(2006, 2, 15, 10, 5)),
 (77, 'Cary', 'Mcconaughey', datetime.datetime(2006, 2, 15, 10, 5)),
 (78, 'Groucho', 'Sinatra', datetime.datetime(2006, 2, 15, 10, 5)),
 (79, 'Mae', 'Hoffman', datetime.datetime(2006, 2, 15, 10, 5)),
 (80, 'Ralph', 'Cruz', datetime.datetime(2006, 2, 15, 10, 5)),
 (81, 'Scarlett', 'Damon', datetime.datetime(2006, 2, 15, 10, 5)),
 (82, 'Woody', 'Jolie', datetime.datetime(2006, 2, 15, 10, 5)),
 (83, 'Ben', 'Willis', datetime.datetime(2006, 2, 15, 10, 5)),
 (84, 'James', 'Pitt', datetime.datetime(2006, 2, 15, 10, 5)),
 (85, 'Minnie', 'Zellweger', datetime.datetime(2006, 2, 15, 10, 5)),
 (143, 'River', 'Dean', datetime.datetime(2006, 2, 15, 10, 5)),
 (86, 'Greg', 'Chaplin', datetime.datetime(2006, 2, 15, 10, 5)),
 (87, 'Spencer', 'Peck', datetime.datetime(2006, 2, 15, 10, 5)),
 (88, 'Kenneth', 'Pesci', datetime.datetime(2006, 2, 15, 10, 5)),
 (89, 'Charlize', 'Dench', datetime.datetime(2006, 2, 15, 10, 5)),
 (90, 'Sean', 'Guiness', datetime.datetime(2006, 2, 15, 10, 5)),
 (91, 'Christopher', 'Berry', datetime.datetime(2006, 2, 15, 10, 5)),
 (92, 'Kirsten', 'Akroyd', datetime.datetime(2006, 2, 15, 10, 5)),
 (93, 'Ellen', 'Presley', datetime.datetime(2006, 2, 15, 10, 5)),
 (94, 'Kenneth', 'Torn', datetime.datetime(2006, 2, 15, 10, 5)),
 (95, 'Daryl', 'Wahlberg', datetime.datetime(2006, 2, 15, 10, 5)),
 (96, 'Gene', 'Willis', datetime.datetime(2006, 2, 15, 10, 5)),
 (97, 'Meg', 'Hawke', datetime.datetime(2006, 2, 15, 10, 5)),
 (98, 'Chris', 'Bridges', datetime.datetime(2006, 2, 15, 10, 5)),
 (99, 'Jim', 'Mostel', datetime.datetime(2006, 2, 15, 10, 5)),
 (100, 'Spencer', 'Depp', datetime.datetime(2006, 2, 15, 10, 5)),
 (101, 'Laura', 'VerHulst', datetime.datetime(2006, 2, 15, 10, 5)),
 (102, 'Walter', 'Torn', datetime.datetime(2006, 2, 15, 10, 5)),
 (103, 'Matthew', 'Leigh', datetime.datetime(2006, 2, 15, 10, 5)),
 (104, 'Penelope', 'Cronyn', datetime.datetime(2006, 2, 15, 10, 5)),
 (105, 'Sidney', 'Crowe', datetime.datetime(2006, 2, 15, 10, 5)),
 (106, 'Groucho', 'Dunst', datetime.datetime(2006, 2, 15, 10, 5)),
 (107, 'Gina', 'Degeneres', datetime.datetime(2006, 2, 15, 10, 5)),
 (108, 'Warren', 'Nolte', datetime.datetime(2006, 2, 15, 10, 5)),
 (109, 'Sylvester', 'Dern', datetime.datetime(2006, 2, 15, 10, 5)),
 (110, 'Laura', 'VerHulst', datetime.datetime(2006, 2, 15, 10, 5)),
 (111, 'Cameron', 'Zellweger', datetime.datetime(2006, 2, 15, 10, 5)),
 (112, 'Russell', 'Bacall', datetime.datetime(2006, 2, 15, 10, 5)),
 (113, 'Morgan', 'Hopkins', datetime.datetime(2006, 2, 15, 10, 5)),
 (114, 'Morgan', 'Mcdormand', datetime.datetime(2006, 2, 15, 10, 5)),
 (115, 'Harrison', 'Bale', datetime.datetime(2006, 2, 15, 10, 5)),
 (116, 'Dan', 'Streep', datetime.datetime(2006, 2, 15, 10, 5)),
 (117, 'Renee', 'Tracy', datetime.datetime(2006, 2, 15, 10, 5)),
 (118, 'Cuba', 'Allen', datetime.datetime(2006, 2, 15, 10, 5)),
 (119, 'Warren', 'Jackman', datetime.datetime(2006, 2, 15, 10, 5)),
 (120, 'Penelope', 'Monroe', datetime.datetime(2006, 2, 15, 10, 5)),
 (121, 'Liza', 'Bergman', datetime.datetime(2006, 2, 15, 10, 5)),
 (122, 'Salma', 'Nolte', datetime.datetime(2006, 2, 15, 10, 5)),
 (123, 'Julianne', 'Dench', datetime.datetime(2006, 2, 15, 10, 5)),
 (124, 'Scarlett', 'Bening', datetime.datetime(2006, 2, 15, 10, 5)),
 (125, 'Albert', 'Nolte', datetime.datetime(2006, 2, 15, 10, 5)),
 (126, 'Frances', 'Tomei', datetime.datetime(2006, 2, 15, 10, 5)),
 (127, 'Kevin', 'Garland', datetime.datetime(2006, 2, 15, 10, 5)),
 (128, 'Cate', 'Mcqueen', datetime.datetime(2006, 2, 15, 10, 5)),
 (129, 'Daryl', 'Crawford', datetime.datetime(2006, 2, 15, 10, 5)),
 (130, 'Greta', 'Keitel', datetime.datetime(2006, 2, 15, 10, 5)),
 (131, 'Jane', 'Jackman', datetime.datetime(2006, 2, 15, 10, 5)),
 (132, 'Adam', 'Hopper', datetime.datetime(2006, 2, 15, 10, 5)),
 (133, 'Richard', 'Penn', datetime.datetime(2006, 2, 15, 10, 5)),
 (134, 'Gene', 'Hopkins', datetime.datetime(2006, 2, 15, 10, 5)),
 (135, 'Rita', 'Reynolds', datetime.datetime(2006, 2, 15, 10, 5)),
 (136, 'Ed', 'Mansfield', datetime.datetime(2006, 2, 15, 10, 5)),
 (137, 'Morgan', 'Williams', datetime.datetime(2006, 2, 15, 10, 5)),
 (138, 'Lucille', 'Dee', datetime.datetime(2006, 2, 15, 10, 5)),
 (139, 'Ewan', 'Gooding', datetime.datetime(2006, 2, 15, 10, 5)),
 (140, 'Whoopi', 'Hurt', datetime.datetime(2006, 2, 15, 10, 5)),
 (141, 'Cate', 'Harris', datetime.datetime(2006, 2, 15, 10, 5)),
 (142, 'Jada', 'Ryder', datetime.datetime(2006, 2, 15, 10, 5)),
 (144, 'Angela', 'Witherspoon', datetime.datetime(2006, 2, 15, 10, 5)),
 (145, 'Kim', 'Allen', datetime.datetime(2006, 2, 15, 10, 5)),
 (146, 'Albert', 'Johansson', datetime.datetime(2006, 2, 15, 10, 5)),
 (147, 'Fay', 'Winslet', datetime.datetime(2006, 2, 15, 10, 5)),
 (148, 'Emily', 'Dee', datetime.datetime(2006, 2, 15, 10, 5)),
 (149, 'Russell', 'Temple', datetime.datetime(2006, 2, 15, 10, 5)),
 (150, 'Jayne', 'Nolte', datetime.datetime(2006, 2, 15, 10, 5)),
 (151, 'Geoffrey', 'Heston', datetime.datetime(2006, 2, 15, 10, 5)),
 (152, 'Ben', 'Harris', datetime.datetime(2006, 2, 15, 10, 5)),
 (153, 'Minnie', 'Kilmer', datetime.datetime(2006, 2, 15, 10, 5)),
 (154, 'Meryl', 'Gibson', datetime.datetime(2006, 2, 15, 10, 5)),
 (155, 'Ian', 'Tandy', datetime.datetime(2006, 2, 15, 10, 5)),
 (156, 'Fay', 'Wood', datetime.datetime(2006, 2, 15, 10, 5)),
 (157, 'Greta', 'Malden', datetime.datetime(2006, 2, 15, 10, 5)),
 (158, 'Vivien', 'Basinger', datetime.datetime(2006, 2, 15, 10, 5)),
 (159, 'Laura', 'Brody', datetime.datetime(2006, 2, 15, 10, 5)),
 (160, 'Chris', 'Depp', datetime.datetime(2006, 2, 15, 10, 5)),
 (161, 'Harvey', 'Hope', datetime.datetime(2006, 2, 15, 10, 5)),
 (162, 'Oprah', 'Kilmer', datetime.datetime(2006, 2, 15, 10, 5)),
 (163, 'Christopher', 'West', datetime.datetime(2006, 2, 15, 10, 5)),
 (164, 'Humphrey', 'Willis', datetime.datetime(2006, 2, 15, 10, 5)),
 (165, 'Al', 'Garland', datetime.datetime(2006, 2, 15, 10, 5)),
 (166, 'Nick', 'Degeneres', datetime.datetime(2006, 2, 15, 10, 5)),
 (167, 'Laurence', 'Bullock', datetime.datetime(2006, 2, 15, 10, 5)),
 (168, 'Will', 'Wilson', datetime.datetime(2006, 2, 15, 10, 5)),
 (169, 'Kenneth', 'Hoffman', datetime.datetime(2006, 2, 15, 10, 5)),
 (170, 'Mena', 'Hopper', datetime.datetime(2006, 2, 15, 10, 5)),
 (171, 'Olympia', 'Pfeiffer', datetime.datetime(2006, 2, 15, 10, 5)),
 (172, 'Groucho', 'Williams', datetime.datetime(2006, 2, 15, 10, 5)),
 (173, 'Alan', 'Dreyfuss', datetime.datetime(2006, 2, 15, 10, 5)),
 (174, 'Michael', 'Bening', datetime.datetime(2006, 2, 15, 10, 5)),
 (175, 'William', 'Hackman', datetime.datetime(2006, 2, 15, 10, 5)),
 (176, 'Jon', 'Chase', datetime.datetime(2006, 2, 15, 10, 5)),
 (177, 'Gene', 'Mckellen', datetime.datetime(2006, 2, 15, 10, 5)),
 (178, 'Lisa', 'Monroe', datetime.datetime(2006, 2, 15, 10, 5)),
 (179, 'Ed', 'Guiness', datetime.datetime(2006, 2, 15, 10, 5)),
 (180, 'Jeff', 'Silverstone', datetime.datetime(2006, 2, 15, 10, 5)),
 (181, 'Matthew', 'Carrey', datetime.datetime(2006, 2, 15, 10, 5)),
 (182, 'Debbie', 'Akroyd', datetime.datetime(2006, 2, 15, 10, 5)),
 (183, 'Russell', 'Close', datetime.datetime(2006, 2, 15, 10, 5)),
 (184, 'Humphrey', 'Garland', datetime.datetime(2006, 2, 15, 10, 5)),
 (185, 'Michael', 'Bolger', datetime.datetime(2006, 2, 15, 10, 5)),
 (186, 'Julia', 'Zellweger', datetime.datetime(2006, 2, 15, 10, 5)),
 (187, 'Renee', 'Ball', datetime.datetime(2006, 2, 15, 10, 5)),
 (188, 'Rock', 'Dukakis', datetime.datetime(2006, 2, 15, 10, 5)),
 (189, 'Cuba', 'Birch', datetime.datetime(2006, 2, 15, 10, 5)),
 (190, 'Audrey', 'Bailey', datetime.datetime(2006, 2, 15, 10, 5)),
 (191, 'Gregory', 'Gooding', datetime.datetime(2006, 2, 15, 10, 5)),
 (192, 'John', 'Suvari', datetime.datetime(2006, 2, 15, 10, 5)),
 (193, 'Burt', 'Temple', datetime.datetime(2006, 2, 15, 10, 5)),
 (194, 'Meryl', 'Allen', datetime.datetime(2006, 2, 15, 10, 5)),
 (195, 'Jayne', 'Silverstone', datetime.datetime(2006, 2, 15, 10, 5)),
 (196, 'Bela', 'Walken', datetime.datetime(2006, 2, 15, 10, 5)),
 (197, 'Reese', 'West', datetime.datetime(2006, 2, 15, 10, 5)),
 (198, 'Mary', 'Keitel', datetime.datetime(2006, 2, 15, 10, 5)),
 (199, 'Julia', 'Fawcett', datetime.datetime(2006, 2, 15, 10, 5)),
 (200, 'Thora', 'Temple', datetime.datetime(2006, 2, 15, 10, 5))]

### Strings
A string is a sequence of characters, either as a  constant or as a variable. Strings are used to represent text, but numbers and dates may still be string types.    
     
#### Example Strings: 
“String”, “Str!nG2!”, “34578”, “U84-32-12-44”, “2018-12-10”

In [21]:
%%sql
-- How do you manually code a string as a field?
-- Note that for Postgres, strings are in single quotes
select
  'Julie' as cdl_employee_0,
  1 as employee_0_id,
  'Laura' as cdl_employee_1,
  2 as employee_1_id
from
  actor

 * postgresql://localhost/postgres
200 rows affected.

[('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2),
 ('Julie', 1, 'Laura', 2)]

### Substrings
When working with strings, you may want to investigate certain portions of strings in your table (AKA substrings). For example, **“Cascade”** is a substring of **“Cascade Data Labs”**.  
  
There are many functions in SQL used to pull substrings. The most common are:

[`left()`](https://www.techonthenet.com/sql_server/functions/right.php) pulls a substring starting from the left side <br>
[`right()`](https://www.techonthenet.com/sql_server/functions/left.php) pulls a substring starting from the right side <br>
[`substring()`](https://www.techonthenet.com/sql_server/functions/substring.php) pulls a substring starting from anywhere (as long as you specify the start and end)

In [27]:
%%sql
left

 * postgresql://localhost/postgres
(psycopg2.errors.SyntaxError) syntax error at or near "left"
LINE 1: left
        ^
 [SQL: 'left'] (Background on this error at: http://sqlalche.me/e/f405)

### String Matching

When working with data, you often want to filter your output to certain instances of strings. For example, you may want to filter out specific products or filter for a certain customer. We will investigate the different methods in string matching through the films and inventory tables.

Common string cleaning functions: <br>
`upper()`
`lower()`
`trim()`

**WHERE-RELATIONAL OPERATOR Clause**  
The WHERE-RELATIONAL OPERATOR Clause is the simplest string matching method (and is not limited to the string data type), but also the least robust. 

**TIP:** For exact string matching of alphabetical strings, it is often easiest to user **UPPER(** string **)** (function to make entire string uppercase) on the word you are searching for, as string data can be inconsistent.

**Film Table**
To get a sense for the information in the film table, let's pull all the fields for the film "Airport Pollock". 

### TO DO: Figure out a way to articulate why single cases are useful in QA, specifically in tracking issues

### Example Query 3:

In [25]:
%%sql
SELECT * 
FROM film 
-- WHERE-RELATIONAL OPERATOR CLAUSE
WHERE UPPER(title) = 'AIRPORT POLLOCK'

 * postgresql+psycopg2://andrewmahler@localhost:5432/sqltool
1 rows affected.

[(8, 'Airport Pollock', 'A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 2006, 1, 6, Decimal('4.99'), 54, Decimal('15.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'])]

The above output reveals some interesting things about this film table:

    1. This DVD store contains films where moose are protagonists and monkeys are anti-heroes.
    2. Values for the special features field are arrays.

### Test Query 3:  In the cell below, write a query to pull the description, release_year, and rental_rate for the film "african egg". Begin the query below "answer <<"

In [26]:
%%sql 
answer << 
select description, release_year, rental_rate from film where UPPER(title) = 'AFRICAN EGG'

 * postgresql+psycopg2://andrewmahler@localhost:5432/sqltool
1 rows affected.
Returning data to local variable answer

### Question 3: Run the below cell after you've run Test Query 3

In [20]:
# Check your query by running this cell
''' 
NOTE: The output of a dataframe contains an index that uniquely identifies rows,
which is different than the output of a SQL query. 

This does not mean that it serves as the table's primary key.
'''
AfricanEggQuestion(answer)

Correct!

**WHERE-LIKE Clause**  
In that last query, we pulled rows with the title "african egg". But what if we we wanted to pull rows where the title contains the word "africa" (or an extension of the word like african). In order to accomplish this, you need the LIKE clause, which allows for pattern matching. The LIKE clause uses wildcards to identify patterns. There are two wildcards used in conjunction with the LIKE operator:   
    1. % The percent sign represents zero, one, or multiple characters       
    2. _ The underscore represents a single character
  
**TIP**: When pattern matching, make your search pattern as specific as possible. The more general your pattern is, the more likely it will return unexpected outputs.

### Example Query 4:

In [22]:
%%sql
SELECT film_id, title FROM film WHERE UPPER(title) LIKE '%AFRICA%'

 * postgresql+psycopg2://andrewmahler@localhost:5432/sqltool
3 rows affected.

[(5, 'African Egg'), (472, 'Italian African'), (637, 'Open African')]